# tap "flother/taps"
# tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# tap "koekeishiya/formulae"
# Utilitaires
## Media (Vidéo, Audio, Image)
# brew "jpeg-xl"
# brew "aom"
# brew "libass"
# brew "ffmpeg"

## Développement (Securité, Connectivité, Utils, etc..)
brew "boost"
brew "unbound"
brew "gnutls"
brew "librist"
brew "gcc"
brew "openblas"
brew "ansible"
brew "git"

## Conversion de fichiers
# brew "osm2pgsql"
# brew "osmium-tool"
# brew "parquet-cli"

## ???
# brew "tesseract"
# brew "openvino"
# brew "pango"
# brew "numpy" # This shouldn't be installed globally
# brew "flother/taps/spreet"
# brew "koekeishiya/formulae/yabai"

# Outils de développement
brew "docker-compose"
brew "terraform"
brew "httpie"
brew "volta"
brew "ansible-lint"

# brew "libpq"
# brew "openjdk@11"
# brew "openjdk@21"
# brew "pipx"
# brew "postgresql@14"
# brew "pyenv"
# brew "python@3.10"
# brew "python@3.11"


# Applications

## Produit
cask "linear-linear"
cask "obs"
cask "slack"
cask "figma"
cask "arc"

## Development
cask "utm"
cask "datagrip"
cask "docker"
cask "visual-studio-code"
cask "httpie"
cask "gitkraken"
cask "warp"
cask "kitty"
cask "runjs"