# tap "flother/taps"
tap "hashicorp/tap"
tap "felixKratz/formulae"
tap "nikitabobko/tap"

## Développement (Securité, Connectivité, Utils, etc..)
brew "boost"
brew "unbound"
brew "gnutls"
brew "librist"
brew "gcc"
brew "openblas"
brew "ansible"
brew "git"
brew "gh"
brew "fzf"
brew "starship"
brew "zsh-autosuggestions"
brew "nmap"

# Outils de développement
brew "docker-compose"
brew "terraform"
brew "httpie"
brew "volta"
brew "jq"
brew "ansible-lint"
brew "uv"
brew "awscli"

# Applications
cask "aerospace"
cask "claude"

## Produit
cask "linear-linear"
cask "obs"
cask "slack"
cask "figma"
cask "obsidian"
cask "arc"

## Development
cask "utm"
cask "docker"
cask "visual-studio-code"
cask "httpie"
cask "gitkraken"
cask "kitty"
cask "runjs"
cask "zed"
cask "claude-code"

## Extension VSCODE
vscode "apollographql.apollo-midnight-color-theme"
vscode "vivaxy.vscode-conventional-commits"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-azuretools.vscode-docker"
vscode "dbaeumer.vscode-eslint"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "eamodio.gitlens"
vscode "bierner.markdown-mermaid"
vscode "unifiedjs.vscode-mdx"
vscode "ms-playwright.playwright"
vscode "esbenp.prettier-vscode"
vscode "YoavBls.pretty-ts-errors"
vscode "inlang.vs-code-extension"
vscode "svelte.svelte-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "4ops.terraform"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "redhat.vscode-yaml"
vscode "christian-kohler.npm-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.ansible"
vscode "DavidAnson.vscode-markdownlint"
vscode "christian-kohler.npm-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "tamasfe.even-better-toml"
vscode "typespec.typespec-vscode"
vscode "wix.vscode-import-cost"
